import multer from "multer";

const storage = multer.diskStorage({
  filename: function (req, file, callback) {
    callback(null, file.originalname);
  },
});

const upload = multer({ storage });

export default upload;

// multer.diskStorage -- Вказує, що файли будуть зберігатися у файловій системі сервера.

// filename:

// Ця функція відповідає за те, як називати файли при збереженні.
// Параметри функції:
// req: об'єкт запиту (можна отримати додаткову інформацію від клієнта, якщо потрібно).
// file: об'єкт із даними про завантажений файл.
// Наприклад, file.originalname — оригінальна назва файлу, яку клієнт передав.
// callback: функція для передачі результату, яка приймає два аргументи:
// null: помилки немає.
// file.originalname: використати оригінальну назву файлу при збереженні.
// У результаті всі завантажені файли отримають ту ж назву, що й на комп'ютері клієнта.

// multer({ storage }):

// Ініціалізує Multer із налаштуванням сховища.
// Об'єкт upload тепер є middleware, яке можна використовувати в маршрутах для обробки завантажень.
